#Найдите сумму цифр трехзначного числа.

print('введите 1-ое число:')
a = int(input())
print('введите 2-ое число:')
b = int(input())
print('введите 3-ие число:')
d = int(input())
print(a, '+', b, '+',  d, '=', a + b + d)